Конфигурация/DataProcessors/ПечатьАктовПриемаПередачиИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьАктовПриемаПередачиИмущества</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/DataProcessors/ПечатьАктовПриемаПередачиИмущества/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Если ЗначениеЗаполнено(ЭтотОбъект.Документ) Тогда
		
		// Проверка корректности документа
		
		Если Не ПроверитьВозможностьПечатиДокумента(Отказ) Тогда
			Возврат;
		КонецЕсли;
		
	Иначе	
		
		ТекстСообщения = "";
		
		Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(ЭтотОбъект.Период, , , ТекстСообщения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Период", , Отказ); 	
		КонецЕсли;
		
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
		
	КонецЕсли;
	
	// Проверка корректности варианта макета
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Вариант) И Не ПроверитьДоступностьВарианта(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьВозможностьПечатиДокумента(Отказ) Экспорт	
	
	РезультатПроверки = Истина;
	
	Если ТипЗнч(ЭтотОбъект.Документ) = Тип("ДокументСсылка.ВыводДенежныхСредств") И ТипЗнч(ЭтотОбъект.Документ.Основание) <> Тип("ДокументСсылка.ПоручениеНаДвижениеДенежныхСредств") Тогда
		
		РезультатПроверки = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать акта не возможна, т.к. основание вывода д/с не является поручением на вывод д/с.", , , , Отказ);
		
	ИначеЕсли ТипЗнч(ЭтотОбъект.Документ) = Тип("ДокументСсылка.ВыводДенежныхСредств") И Не ЗначениеЗаполнено(ЭтотОбъект.Документ.Основание) Тогда
		
		РезультатПроверки = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать акта не возможна, т.к. не указано поручение на вывод д/с.", , , , Отказ);
		
	КонецЕсли;
		
	Возврат РезультатПроверки;
	
КонецФункции

Функция ПроверитьДоступностьВарианта(Отказ) Экспорт	
	
	РезультатПроверки = Истина;
	
	Макет = ЭтотОбъект.Метаданные().Макеты.Найти(ЭтотОбъект.Вариант);
	
	Если Макет = Неопределено Тогда
		
		РезультатПроверки = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Неизвестный вариант макета '%1'.", ЭтотОбъект.Вариант), , , , Отказ);
		
	Иначе
		
		ДоступныеМакеты = Обработки.ПечатьАктовПриемаПередачиИмущества.ДоступныеМакеты(ЭтотОбъект.Документ, ЭтотОбъект.СчетДоверительногоУправления);
		
		Если ДоступныеМакеты.НайтиПоЗначению(Макет.Имя) = Неопределено Тогда
		
			РезультатПроверки = Ложь;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Вариант макета '%1' не доступен для выбранных реквизитов.", Макет.Синоним), , , , Отказ);
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции
